app/controllers/posts_controller.rb

  def index

    if params[:category].blank?
      @posts = Post.all
---
SELECT `posts`.* FROM `posts`

  def create
    # The “create” action initializes a new “Post” instance assigning attribute values from the params hash that
    # are allowed through mass assignment in the post_params method (require & permit). It creates a new row in the
    # posts database. So with this the “@post” now holds an instance of the “Post” model with values supplied by
    # the browser and held by the params hash
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('pokemon', '<p>pokemon&nbsp;pokemon&nbsp;pokemon&nbsp;pokemon</p>\r\n', '2018-03-15 19:09:41', '2018-03-15 19:09:41')

  def update
    # The “update” action also benefits from the before_action that find the relevant post for us based on the URL params.
    if @post.update_attributes(post_params)
---
UPDATE `posts` SET `title` = 'sdasdasdas', `body` = '<p>asdasdasdsadsadsad</p>\r\n', `updated_at` = '2018-03-15 18:55:28' WHERE `posts`.`id` = 1

  def find_post
    # It is used to extract from hash of parameters sent by url from the browser and then look into the posts db for the id
    # the post object is returned in the @post, @post is an instance variable and is now available in our "views"
    @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1